import os
import testRead3
import pandas as pd

path = "/home/iluo/桌面/pdf/"
fileList = os.listdir(path)
colName = ['公司', '时间', '核心偿付能力溢额（万元）', '核心偿付能力充足率（%）', '综合偿付能力溢额（万元）', '综合偿付能力充足率（%）', '最近一期风险综合评级', '保险业务收入（万元）',
           '净利润（万元）', '净资产（万元）', '认可资产（万元）', '认可负债（万元）', '实际资本（万元）',
           '核心一级资本（万元）', '核心二级资本（万元）', '附属一级资本（万元）', '附属二级资本（万元）', '量化风险最低资本（万元）', '寿险业务保险风险最低资本（万元）',
           '非寿险业务保险风险最低资本（万元）', '保险风险最低资本（万元）', '市场风险最低资本（万元）',
           '信用风险最低资本（万元）', '风险分散效应（万元）', '损失吸收效应（万元）', '控制风险最低资本（万元）', '附加资本（万元）', '逆周期附加资本（万元）',
           '国内系统重要性保险机构的附加资本（万元）', '全球系统重要性保险机构的附加资本（万元）', '其他附加资本（万元）',
           '最低资本（万元）', '实际净现金流（百万）', '未来三个月内综合流动比率（%）', '未来1年综合流动比率（%）', '未来1到3年内综合流动比率（%）', '未来3到5年综合流动比例（%）',
           '未来5年以上综合流动比率（%）', '公司整体流动性覆盖率（%）_压力情景1', '公司整体流动性覆盖率（%）_压力情景2', '报告期内公司是否被保监会采取监管措施']
df = pd.DataFrame(columns= colName)
for file in fileList:
    if(os.path.splitext(file)[1] == '.pdf'):
        print(file)
        pdfPath = path + file
        data = testRead3.getDataFromOnePdf(pdfPath)
        df.loc[file] = data

df.to_excel("text.xlsx")